---
kind: type
id: T:Autodesk.Revit.DB.ISaveSharedCoordinatesCallbackForUnloadLocally
source: html/021f9320-4a8b-d6a3-2ae3-424e4752c37b.htm
---
# Autodesk.Revit.DB.ISaveSharedCoordinatesCallbackForUnloadLocally

An interface that is used to control Revit when trying to unload
 locally a Revit link with changes in shared coordinates.

## Syntax (C#)
```csharp
public interface ISaveSharedCoordinatesCallbackForUnloadLocally
```